---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.TemperatureRatingType
source: html/c2cb02c8-4901-0da8-4706-abac3438a689.htm
---
# TemperatureRatingType Methods

Add a new electrical correction factor type to this temperature rating type. The given temperature
value should be quantified in the document's selected unit of electrical temperature.